<script setup>
import AppLayout from '@/layouts/AppLayout.vue'
</script>

<template>
    <AppLayout
        class="flex flex-col items-center justify-center min-h-dvh ml-[20%] max-xl:ml-[25%] w-[80%] max-xl:w-3/4 max-lg:max-xl:w-full max-lg:ml-0">
        <div class="flex items-center justify-center duration-500">
            <div
                class="bg-white rounded-2xl shadow-[7px_7px_5px_#00000040] h-auto flex justify-center items-center p-18 max-lg:p-8 w-full">
                <div class="flex justify-center items-start flex-col gap-6 w-full">
                    <div>
                        <div>
                            <h1 class="font-alumini text-3xl tracking-wider">Политика конфиденциальности Cargo Pulse
                            </h1>
                            <p class="text-lg">Cargo Pulse — цифровая биржа грузоперевозок. Мы ценим вашу приватность и
                                обязуемся обеспечивать высокий уровень защиты персональных данных пользователей.</p>
                        </div>
                    </div>

                    <div>
                        <div>
                            <h2 class="text-2xl font-semibold mb-4">1. Введение</h2>
                            <p>Добро пожаловать на платформу Cargo Pulse. Настоящая Политика конфиденциальности
                                описывает, как мы собираем, используем, храним и защищаем информацию, которую вы
                                предоставляете при регистрации, использовании сервиса или взаимодействии с нами.</p>
                        </div>
                    </div>

                    <div>
                        <div>
                            <h2 class="text-2xl font-semibold mb-4">2. Какие данные мы собираем?</h2>
                            <ul class="list-disc mt-2 space-y-2">
                                <li>
                                    <strong>Персональные данные:</strong>
                                    имя, фамилия, номер телефона, адрес электронной почты, ИНН/ОГРНИП (для юрлиц), а
                                    также другая информация, предоставляемая вами при регистрации.
                                </li>
                                <li>
                                    <strong>Контактная информация:</strong>
                                    данные для связи с вами (включая WhatsApp, Telegram и другие мессенджеры).
                                </li>
                                <li>
                                    <strong>Информация о грузах и перевозках:</strong>
                                    описание груза, вес, объём, место отправки, пункт назначения, сроки доставки и
                                    другие детали, указанные при создании заказа.
                                </li>
                                <li>
                                    <strong>Платежные данные:</strong>
                                    банковские реквизиты, номер карты, методы оплаты, которые используются для
                                    совершения платежей через наш сервис.
                                </li>
                                <li>
                                    <strong>Технические данные:</strong>
                                    IP-адрес, тип устройства, операционная система, браузер, информация о сессиях,
                                    cookies и другие технические данные, собранные автоматически при посещении сайта или
                                    использования мобильного приложения.
                                </li>
                                <li>
                                    <strong>История взаимодействия:</strong>
                                    информация о ваших действиях в системе, включая просмотренные предложения,
                                    выполненные сделки, коммуникации с водителями и клиентами.
                                </li>
                            </ul>
                        </div>
                    </div>

                    <div>
                        <div>
                            <h2 class="text-2xl font-semibold mb-4">3. Цели использования информации</h2>
                            <ul class="list-disc mt-2 space-y-2">
                                <li>Для регистрации, авторизации и поддержания работы аккаунта пользователя.</li>
                                <li>Для обработки заказов, связывания грузоотправителей и водителей, контроля за
                                    выполнением перевозок.</li>
                                <li>Для отправки уведомлений о статусе заказа, изменениях условий, предупреждений и
                                    других важных сообщений.</li>
                                <li>Для анализа эффективности работы платформы, улучшения функционала и
                                    пользовательского опыта.</li>
                                <li>Для выполнения обязательств перед государственными органами, налоговым
                                    законодательством и другими нормативными актами.</li>
                                <li>Для предотвращения мошенничества, спама и других неправомерных действий.</li>
                            </ul>
                        </div>
                    </div>

                    <div>
                        <div>
                            <h2 class="text-2xl font-semibold mb-4">4. Обработка и защита данных</h2>
                            <p>Cargo Pulse не раскрывает ваши личные данные третьим лицам без вашего согласия, за
                                исключением случаев, когда это требуется законодательством или необходимо для
                                обеспечения безопасности системы. Мы применяем современные технологии шифрования,
                                безопасное хранение данных на серверах и регулярные проверки системы на соответствие
                                требованиям безопасности.</p>
                        </div>
                    </div>

                    <div>
                        <div>
                            <h2 class="text-2xl font-semibold mb-4">5. Хранение и удаление данных</h2>
                            <p>Ваши данные сохраняются в течение времени, необходимого для выполнения целей, указанных
                                выше, либо в соответствии с действующим законодательством. По истечении этого срока
                                данные будут удалены или анонимизированы.</p>
                        </div>
                    </div>

                    <div>
                        <div>
                            <h2 class="text-2xl font-semibold mb-4">6. Ваши права</h2>
                            <p>Вы имеете право:</p>
                            <ul class="list-disc pl-6 mt-2 space-y-2">
                                <li>Запросить копию своих данных.</li>
                                <li>Требовать исправления неточной информации.</li>
                                <li>Отозвать согласие на обработку данных.</li>
                                <li>Удалить свои данные из нашей системы.</li>
                                <li>Ограничить использование ваших данных.</li>
                                <li>Передать данные другому оператору (при наличии технической возможности).</li>
                            </ul>
                            <p>Чтобы воспользоваться своими правами, свяжитесь с нашей службой поддержки.</p>
                        </div>
                    </div>

                    <div>
                        <div>
                            <h2 class="text-2xl font-semibold mb-4">7. Изменения в политике</h2>
                            <p>Cargo Pulse имеет право вносить изменения в настоящую Политику конфиденциальности. Все
                                обновления будут опубликованы на сайте, а существующие пользователи будут
                                проинформированы соответствующим образом.</p>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </AppLayout>
</template>